bvladalex/tm4c123/spi_drivers_tx_only/drivers/inc/tm4c123_spi_driver.h
#ifndef INC_TM4C123_SPI_DRV_HEADER
#define INC_TM4C123_SPI_DRV_HEADER

#include "TM4C123GH6PM_mcu1.h"

typedef struct{
	uint8_t SPI_DeviceMode;
	uint8_t SPI_SclkSpeed;
	uint8_t SPI_DFF;
	uint8_t SPI_CPOL;
	uint8_t SPI_CPHA;
	uint8_t SPI_CLKS;
}SPI_Config_t;

typedef struct{
	SSI0_Type *pSPIx;
	SPI_Config_t SPIConfig;
}SPI_Handle_t;

////////Macros for SPI/////

#define SPI_DEVICE_MODE_MASTER 0
#define SPI_DEVICE_MODE_SLAVE 1

/*
#define SPI_BUSCONFIG_FULLDUPLEX 0
#define SPI_BUSCONFIG_HALFDUPLEX 0
#define SPI_BUSCONFIG_SIMPLEX_TXONLY 0
#define SPI_BUSCONFIG_SIMPLEX_RXONLY 0
*/


/*///Clock configuration/////
Clock is derived from following formula:
SSInClk = SysClk / (CPSDVSR * (1 + SCR))
where CPSDVSR is written in SSI clock prescaler SSix->CPSR [7:0], the value programmed into this register must be an even number between 2 and 254
and SCR is written in SSI clock rate reg SSIx->CR0 [15:8], 0->255
So, MAX value for SSI clock is SSInClk = SysClk / 2 when CPSDVSR is default 2 and SCR is default 0;

For the following configuration it is assumed that the SySclock div is set to 0 and you can change the PreScaler to one of the 4 pre-defined values
*/

#define SPI_SCLKSPEED_DIV2   (1U<<1)
#define SPI_SCLKSPEED_DIV4   (1U<<2)
#define SPI_SCLKSPEED_DIV8   (1U<<3)
#define SPI_SCLKSPEED_DIV16  (1U<<4)

////SPI peripheral Data Frame format [size] ///////////

#define SPI_DSS_8BITS   0x7
#define SPI_DSS_16BITS  0xf


/////SPI CPOL and CPHA

#define SPI_CPHA_FIRST   0   // first clock edge
#define SPI_CPHA_SECOND  1   // second clock edge

#define SPI_CPOL_HIGH 1
#define SPI_CPOL_LOW  0


////Clock source for SSi peripheral

#define SPI_CLK_SOURCE_PIOSC    0x5
#define SPI_CLK_SOURCE_SYSCLK   0x0

///Macro definitions for the flags used in TX and RX APIs

#define SPI_TFE_POS   0
#define SPI_RNE_POS		2
#define SPI_BSY_POS		4

#define SPI_TFE_FLAG (1<<SPI_TFE_POS)
#define SPI_RNE_FLAG (1<<SPI_RNE_POS)
#define SPI_BSY_FLAG (1<<SPI_BSY_POS)

//////////////////APIs for SPI peripheral section////////////////

//Peripheral clock setup
void SPI_PeriClockControl(SSI0_Type *pSPIx, uint8_t EnorDi);



//Init and De-init
void SPI_Init(SPI_Handle_t *pSPIHandle);
void SPI_DeInit(SSI0_Type *pSPIx);

void SPI_disable(SSI0_Type *pSPIx);
void SPI_enable(SSI0_Type *pSPIx);

uint8_t SPI_GetFlagStatus(SSI0_Type *pSPIx, uint32_t FlagName);

//Data send and data receive

void SPI_SendData(SSI0_Type *pSPIx, uint8_t *pTxBuffer, uint32_t Len);

void SPI_ReceiveData(SSI0_Type *pSPIx, uint8_t *pRxBuffer, uint32_t Len);


//IRQ Configuration and ISR handling

void SPI_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDis);
void SPI_IRQHandling(SPI_Handle_t *pHandle);
void SPI_IRQPriorityConfig(uint8_t IRQNumber,uint8_t IRQPriority);

#endif /*INC_TM4C123_GPIO_DRV_HEADER */
